Model: "Model2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_20 (Conv2D)           (None, 72, 52, 20)        560       
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 36, 26, 20)        0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 36, 26, 40)        7240      
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 18, 13, 40)        0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 18, 13, 60)        21660     
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 9, 7, 60)          0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 9, 7, 80)          43280     
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 5, 4, 80)          0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 5, 4, 100)         72100     
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 3, 2, 100)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 600)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 100)               60100     
=================================================================
Total params: 204,940
Trainable params: 204,940
Non-trainable params: 0
_________________________________________________________________


Model: "Model2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_9 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_10 (InputLayer)           [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model2 (Sequential)             (None, 100)          204940      input_9[0][0]                    
                                                                 input_10[0][0]                   
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 100)          0           Model2[0][0]                     
                                                                 Model2[1][0]                     
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 2)            202         lambda_4[0][0]                   
==================================================================================================
Total params: 205,142
Trainable params: 205,142
Non-trainable params: 0
__________________________________________________________________________________________________
