Model: "Model3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_36 (Conv2D)           (None, 72, 52, 20)        1520      
_________________________________________________________________
max_pooling2d_34 (MaxPooling (None, 36, 26, 20)        0         
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 36, 26, 40)        20040     
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 18, 13, 40)        0         
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 18, 13, 60)        60060     
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 16, 11, 60)        32460     
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 8, 6, 60)          0         
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 8, 6, 100)         150100    
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 6, 4, 100)         90100     
_________________________________________________________________
max_pooling2d_37 (MaxPooling (None, 3, 2, 100)         0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 600)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 100)               60100     
=================================================================
Total params: 414,380
Trainable params: 414,380
Non-trainable params: 0
_________________________________________________________________


Model: "Model3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_15 (InputLayer)           [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_16 (InputLayer)           [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model3 (Sequential)             (None, 100)          414380      input_15[0][0]                   
                                                                 input_16[0][0]                   
__________________________________________________________________________________________________
lambda_7 (Lambda)               (None, 100)          0           Model3[0][0]                     
                                                                 Model3[1][0]                     
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 2)            202         lambda_7[0][0]                   
==================================================================================================
Total params: 414,582
Trainable params: 414,582
Non-trainable params: 0
__________________________________________________________________________________________________
