Model: "Model5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_52 (Conv2D)           (None, 72, 52, 30)        4440      
_________________________________________________________________
max_pooling2d_48 (MaxPooling (None, 36, 26, 30)        0         
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 36, 26, 60)        45060     
_________________________________________________________________
max_pooling2d_49 (MaxPooling (None, 18, 13, 60)        0         
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 18, 13, 120)       64920     
_________________________________________________________________
max_pooling2d_50 (MaxPooling (None, 9, 7, 120)         0         
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 9, 7, 60)          64860     
_________________________________________________________________
max_pooling2d_51 (MaxPooling (None, 5, 4, 60)          0         
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 5, 4, 60)          14460     
_________________________________________________________________
max_pooling2d_52 (MaxPooling (None, 3, 2, 60)          0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 360)               0         
_________________________________________________________________
dense_20 (Dense)             (None, 160)               57760     
_________________________________________________________________
dense_21 (Dense)             (None, 160)               25760     
=================================================================
Total params: 277,260
Trainable params: 277,260
Non-trainable params: 0
_________________________________________________________________


Model: "Model5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_21 (InputLayer)           [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_22 (InputLayer)           [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model5 (Sequential)             (None, 160)          277260      input_21[0][0]                   
                                                                 input_22[0][0]                   
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, 160)          0           Model5[0][0]                     
                                                                 Model5[1][0]                     
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 2)            322         lambda_10[0][0]                  
==================================================================================================
Total params: 277,582
Trainable params: 277,582
Non-trainable params: 0
__________________________________________________________________________________________________
