Model: "Model7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 70, 50, 25)        700       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 35, 25, 25)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 33, 23, 50)        11300     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 17, 12, 50)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 15, 10, 100)       45100     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 8, 5, 100)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 6, 3, 200)         180200    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 3, 2, 200)         0         
_________________________________________________________________
flatten (Flatten)            (None, 1200)              0         
_________________________________________________________________
dense (Dense)                (None, 150)               180150    
=================================================================
Total params: 417,450
Trainable params: 417,450
Non-trainable params: 0
_________________________________________________________________


Model: "Model7"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model7 (Sequential)             (None, 150)          417450      input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 150)          0           Model7[0][0]                     
                                                                 Model7[1][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2)            302         lambda[0][0]                     
==================================================================================================
Total params: 417,752
Trainable params: 417,752
Non-trainable params: 0
__________________________________________________________________________________________________
