Model: "Model4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 72, 52, 40)        1120      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 36, 26, 40)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 36, 26, 40)        40040     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 18, 13, 40)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 18, 13, 40)        14440     
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 9, 7, 40)          0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 9, 7, 40)          14440     
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 5, 4, 40)          0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 5, 4, 40)          6440      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 3, 2, 40)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 240)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 160)               38560     
=================================================================
Total params: 115,040
Trainable params: 115,040
Non-trainable params: 0
_________________________________________________________________


Model: "Model4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model4 (Sequential)             (None, 160)          115040      input_3[0][0]                    
                                                                 input_4[0][0]                    
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 160)          0           Model4[0][0]                     
                                                                 Model4[1][0]                     
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 2)            322         lambda_1[0][0]                   
==================================================================================================
Total params: 115,362
Trainable params: 115,362
Non-trainable params: 0
__________________________________________________________________________________________________
