Model: "Model4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_42 (Conv2D)           (None, 72, 52, 40)        1120      
_________________________________________________________________
max_pooling2d_38 (MaxPooling (None, 36, 26, 40)        0         
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 36, 26, 40)        40040     
_________________________________________________________________
max_pooling2d_39 (MaxPooling (None, 18, 13, 40)        0         
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 18, 13, 40)        14440     
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 9, 7, 40)          0         
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 9, 7, 40)          14440     
_________________________________________________________________
max_pooling2d_41 (MaxPooling (None, 5, 4, 40)          0         
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 5, 4, 40)          6440      
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 3, 2, 40)          0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 240)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 160)               38560     
=================================================================
Total params: 115,040
Trainable params: 115,040
Non-trainable params: 0
_________________________________________________________________


Model: "Model4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_17 (InputLayer)           [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_18 (InputLayer)           [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model4 (Sequential)             (None, 160)          115040      input_17[0][0]                   
                                                                 input_18[0][0]                   
__________________________________________________________________________________________________
lambda_8 (Lambda)               (None, 160)          0           Model4[0][0]                     
                                                                 Model4[1][0]                     
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 2)            322         lambda_8[0][0]                   
==================================================================================================
Total params: 115,362
Trainable params: 115,362
Non-trainable params: 0
__________________________________________________________________________________________________
