Model: "Model0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 72, 52, 32)        4736      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 36, 26, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 36, 26, 64)        51264     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 18, 13, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 18, 13, 128)       73856     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 9, 7, 128)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 9, 7, 128)         147584    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 5, 4, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 5, 4, 256)         131328    
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 3, 2, 256)         0         
_________________________________________________________________
flatten (Flatten)            (None, 1536)              0         
_________________________________________________________________
dense (Dense)                (None, 160)               245920    
=================================================================
Total params: 654,688
Trainable params: 654,688
Non-trainable params: 0
_________________________________________________________________


Model: "Model0"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model0 (Sequential)             (None, 160)          654688      input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 160)          0           Model0[0][0]                     
                                                                 Model0[1][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2)            322         lambda[0][0]                     
==================================================================================================
Total params: 655,010
Trainable params: 655,010
Non-trainable params: 0
__________________________________________________________________________________________________
