Model: "Model5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_57 (Conv2D)           (None, 72, 52, 30)        4440      
_________________________________________________________________
max_pooling2d_53 (MaxPooling (None, 36, 26, 30)        0         
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 36, 26, 60)        45060     
_________________________________________________________________
max_pooling2d_54 (MaxPooling (None, 18, 13, 60)        0         
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 18, 13, 120)       64920     
_________________________________________________________________
max_pooling2d_55 (MaxPooling (None, 9, 7, 120)         0         
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 9, 7, 60)          64860     
_________________________________________________________________
max_pooling2d_56 (MaxPooling (None, 5, 4, 60)          0         
_________________________________________________________________
conv2d_61 (Conv2D)           (None, 5, 4, 60)          14460     
_________________________________________________________________
max_pooling2d_57 (MaxPooling (None, 3, 2, 60)          0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 360)               0         
_________________________________________________________________
dense_23 (Dense)             (None, 160)               57760     
_________________________________________________________________
dense_24 (Dense)             (None, 160)               25760     
=================================================================
Total params: 277,260
Trainable params: 277,260
Non-trainable params: 0
_________________________________________________________________


Model: "Model5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_23 (InputLayer)           [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_24 (InputLayer)           [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model5 (Sequential)             (None, 160)          277260      input_23[0][0]                   
                                                                 input_24[0][0]                   
__________________________________________________________________________________________________
lambda_11 (Lambda)              (None, 160)          0           Model5[0][0]                     
                                                                 Model5[1][0]                     
__________________________________________________________________________________________________
dense_25 (Dense)                (None, 2)            322         lambda_11[0][0]                  
==================================================================================================
Total params: 277,582
Trainable params: 277,582
Non-trainable params: 0
__________________________________________________________________________________________________
