Model: "Model6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 72, 52, 25)        700       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 36, 26, 25)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 36, 26, 50)        11300     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 18, 13, 50)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 18, 13, 100)       45100     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 9, 7, 100)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 9, 7, 200)         180200    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 5, 4, 200)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 5, 4, 300)         540300    
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 3, 2, 300)         0         
_________________________________________________________________
flatten (Flatten)            (None, 1800)              0         
_________________________________________________________________
dense (Dense)                (None, 150)               270150    
=================================================================
Total params: 1,047,750
Trainable params: 1,047,750
Non-trainable params: 0
_________________________________________________________________


Model: "Model6"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model6 (Sequential)             (None, 150)          1047750     input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 150)          0           Model6[0][0]                     
                                                                 Model6[1][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2)            302         lambda[0][0]                     
==================================================================================================
Total params: 1,048,052
Trainable params: 1,048,052
Non-trainable params: 0
__________________________________________________________________________________________________
