Model: "Model4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 72, 52, 40)        1120      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 36, 26, 40)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 36, 26, 40)        40040     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 18, 13, 40)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 18, 13, 40)        14440     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 9, 7, 40)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 9, 7, 40)          14440     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 5, 4, 40)          0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 5, 4, 40)          6440      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 3, 2, 40)          0         
_________________________________________________________________
flatten (Flatten)            (None, 240)               0         
_________________________________________________________________
dense (Dense)                (None, 160)               38560     
=================================================================
Total params: 115,040
Trainable params: 115,040
Non-trainable params: 0
_________________________________________________________________


Model: "Model4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model4 (Sequential)             (None, 160)          115040      input_1[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 160)          0           Model4[0][0]                     
                                                                 Model4[1][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2)            322         lambda[0][0]                     
==================================================================================================
Total params: 115,362
Trainable params: 115,362
Non-trainable params: 0
__________________________________________________________________________________________________
