Model: "Model1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 72, 52, 20)        2960      
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 36, 26, 20)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 36, 26, 40)        20040     
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 18, 13, 40)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 18, 13, 60)        21660     
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 9, 7, 60)          0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 9, 7, 80)          43280     
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 5, 4, 80)          0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 5, 4, 100)         32100     
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 3, 2, 100)         0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 600)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 100)               60100     
=================================================================
Total params: 180,140
Trainable params: 180,140
Non-trainable params: 0
_________________________________________________________________


Model: "Model1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_6 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model1 (Sequential)             (None, 100)          180140      input_5[0][0]                    
                                                                 input_6[0][0]                    
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 100)          0           Model1[0][0]                     
                                                                 Model1[1][0]                     
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 2)            202         lambda_2[0][0]                   
==================================================================================================
Total params: 180,342
Trainable params: 180,342
Non-trainable params: 0
__________________________________________________________________________________________________
