Model: "Model0"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 72, 52, 32)        4736      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 36, 26, 32)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 36, 26, 64)        51264     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 18, 13, 64)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 18, 13, 128)       73856     
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 9, 7, 128)         0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 9, 7, 128)         147584    
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 5, 4, 128)         0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 5, 4, 256)         131328    
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 3, 2, 256)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1536)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 160)               245920    
=================================================================
Total params: 654,688
Trainable params: 654,688
Non-trainable params: 0
_________________________________________________________________


Model: "Model0"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model0 (Sequential)             (None, 160)          654688      input_3[0][0]                    
                                                                 input_4[0][0]                    
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 160)          0           Model0[0][0]                     
                                                                 Model0[1][0]                     
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 2)            322         lambda_1[0][0]                   
==================================================================================================
Total params: 655,010
Trainable params: 655,010
Non-trainable params: 0
__________________________________________________________________________________________________
