Model: "Model8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 70, 50, 25)        700       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 35, 25, 25)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 33, 23, 50)        11300     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 17, 12, 50)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 17, 12, 100)       45100     
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 15, 10, 100)       90100     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 8, 5, 100)         0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 8, 5, 200)         180200    
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 6, 3, 200)         360200    
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 3, 2, 200)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1200)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 150)               180150    
=================================================================
Total params: 867,750
Trainable params: 867,750
Non-trainable params: 0
_________________________________________________________________


Model: "Model8"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model8 (Sequential)             (None, 150)          867750      input_3[0][0]                    
                                                                 input_4[0][0]                    
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 150)          0           Model8[0][0]                     
                                                                 Model8[1][0]                     
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 2)            302         lambda_1[0][0]                   
==================================================================================================
Total params: 868,052
Trainable params: 868,052
Non-trainable params: 0
__________________________________________________________________________________________________
