Model: "Model2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_25 (Conv2D)           (None, 72, 52, 20)        560       
_________________________________________________________________
max_pooling2d_25 (MaxPooling (None, 36, 26, 20)        0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 36, 26, 40)        7240      
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 18, 13, 40)        0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 18, 13, 60)        21660     
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 9, 7, 60)          0         
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 9, 7, 80)          43280     
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 5, 4, 80)          0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 5, 4, 100)         72100     
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 3, 2, 100)         0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 600)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 100)               60100     
=================================================================
Total params: 204,940
Trainable params: 204,940
Non-trainable params: 0
_________________________________________________________________


Model: "Model2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_11 (InputLayer)           [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
input_12 (InputLayer)           [(None, 72, 52, 3)]  0                                            
__________________________________________________________________________________________________
Model2 (Sequential)             (None, 100)          204940      input_11[0][0]                   
                                                                 input_12[0][0]                   
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 100)          0           Model2[0][0]                     
                                                                 Model2[1][0]                     
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 2)            202         lambda_5[0][0]                   
==================================================================================================
Total params: 205,142
Trainable params: 205,142
Non-trainable params: 0
__________________________________________________________________________________________________
